{
  "architectures": [
    "DeepseekV3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_deepseek_v3.DeepseekV3Config",
    "AutoModel": "modeling_deepseek_v3.DeepseekV3Model",
    "AutoModelForCausalLM": "modeling_deepseek_v3.DeepseekV3ForCausalLM"
  },
  "bos_token_id": 128000,
  "dtype": "bfloat16",
  "embedding_initializer_range": 0.02795084971874737,
  "eos_token_id": 128001,
  "ep_size": 1,
  "first_k_dense_replace": 32,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "index_absorb": true,
  "index_head_dim": 128,
  "index_n_heads": 16,
  "index_topk": 2048,
  "index_weights": "value",
  "indexer_norm": "rmsnorm",
  "initializer_range": 0.013975424859373685,
  "intermediate_size": 6144,
  "kv_lora_rank": 512,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "deepseek_v3",
  "moe_intermediate_size": null,
  "moe_layer_freq": 0,
  "mtp_loss_weight": 0.3,
  "n_group": null,
  "n_routed_experts": null,
  "n_shared_experts": null,
  "norm_topk_prob": false,
  "num_attention_heads": 16,
  "num_experts_per_tok": null,
  "num_hidden_layers": 32,
  "num_key_value_heads": 16,
  "pretraining_tp": 1,
  "q_lora_rank": 1536,
  "qk_head_dim": 192,
  "qk_latent_norm": true,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-06,
  "rope_interleave": true,
  "rope_scaling": null,
  "rope_theta": 100000,
  "routed_scaling_factor": null,
  "tie_word_embeddings": false,
  "topk_group": null,
  "transformers_version": "4.57.3",
  "use_cache": false,
  "v_head_dim": 128,
  "vocab_size": 128256
}
